src/src/InformationRegisters/AccountingPolicy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>AccountingPolicy</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RegisteredForVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostVATEntriesBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostAdvancePaymentsBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ObsoleteUseTaxInvoices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueAutomaticallyAgainstSales</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DefaultVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATThreshold</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CashMethodOfAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InventoryValuationMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryValuationMethods</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnFromCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnToSupplier</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/Inventory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Inventory</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>StructuralUnitCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductsCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CharacteristicCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BatchCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerCorrOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Specification</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpecificationCorr</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BillsOfMaterials</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrSalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SourceDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.InventoryWriteOff</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AccountSalesFromConsignee</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReportIssued</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.ShiftClosure</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixedCost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductionExpenses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Return</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetailTransferEarningAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OfflineRecord</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesRep</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/VATIncurred.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>VATIncurred</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountExcludesVAT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Supplier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ShipmentDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.RegistersCorrection</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.DebitNote</v8:Type>
						<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/VATInput.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>VATInput</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountExcludesVAT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VATOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Supplier</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ShipmentDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomsDeclaration</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.DebitNote</v8:Type>
						<v8:Type>cfg:DocumentRef.CashVoucher</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/VATOutput.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>VATOutput</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountExcludesVAT</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VATOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProductType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ProductsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ShipmentDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomsDeclaration</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.CreditNote</v8:Type>
						<v8:Type>cfg:DocumentRef.ShiftClosure</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/Enums/YesNo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>YesNo</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Yes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>No</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/OperationTypesGoodsReturn.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesGoodsReturn</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FromCustomer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToSupplier</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/InformationRegisters/AccountingPolicy/Forms/RecordForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Period") Then
		Record.Period = Parameters.Period;
	ElsIf Record.SourceRecordKey.IsEmpty() Then
		Record.Period = BegOfYear(CurrentDate());
	EndIf; 
	
	If Parameters.Property("Company") Then
		Record.Company = Parameters.Company;
		Items.Company.Visible = False;
	EndIf;
	
	If NOT ValueIsFilled(Record.Company) Then
		Record.Company = Catalogs.Companies.MainCompany;
	EndIf;
	
	If Not Record.RegisteredForVAT Then
		ChangeRegisteredForVATAtServer();
	EndIf;
	
	ChangeEnabled();
	
	Company				= Record.Company;
	Period				= Record.Period;
	RegisteredForVAT	= Record.RegisteredForVAT;
	
	PostAdvancePaymentsBySourceDocuments = Record.PostAdvancePaymentsBySourceDocuments;
	PostVATEntriesBySourceDocuments = Record.PostVATEntriesBySourceDocuments;
	InventoryValuationMethod = Record.InventoryValuationMethod;
	
	SetIssueAutomaticallyAgainstSales();
	
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	
	WriteParameters.Insert("Company",	Company);
	WriteParameters.Insert("Period",	Period);
	WriteParameters.Insert("UseGoodsReturnFromCustomer",	Record.UseGoodsReturnFromCustomer);
	WriteParameters.Insert("UseGoodsReturnToSupplier",		Record.UseGoodsReturnToSupplier);
	WriteParameters.Insert("InventoryValuationMethod",		Record.InventoryValuationMethod);
	
	Record.UseGoodsReturnFromCustomer	= ?(UseGoodsReturnFromCustomer = PredefinedValue("Enum.YesNo.Yes"), True, False);
	Record.UseGoodsReturnToSupplier		= ?(UseGoodsReturnToSupplier = PredefinedValue("Enum.YesNo.Yes"), True, False);
	
	Record.InventoryValuationMethod = InventoryValuationMethod;
	
	Record.PostAdvancePaymentsBySourceDocuments = PostAdvancePaymentsBySourceDocuments;
	Record.PostVATEntriesBySourceDocuments = PostVATEntriesBySourceDocuments;
	Record.ObsoleteUseTaxInvoices = Not PostVATEntriesBySourceDocuments;
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	CompanyWasChanged	= WriteParameters.Company <> Record.Company; 
	PeriodWasChanged	= WriteParameters.Period <> Record.Period; 
	UseGoodsReturnFromCustomerWasChanged = WriteParameters.UseGoodsReturnFromCustomer <> Record.UseGoodsReturnFromCustomer;
	UseGoodsReturnToSupplierWasChanged	 = WriteParameters.UseGoodsReturnToSupplier <> Record.UseGoodsReturnToSupplier;
	InventoryValuationMethodWasChanged	 = WriteParameters.InventoryValuationMethod <> Record.InventoryValuationMethod;

	If CompanyWasChanged
		Or PeriodWasChanged
		Or UseGoodsReturnFromCustomerWasChanged
		Or UseGoodsReturnToSupplierWasChanged 
		Or InventoryValuationMethodWasChanged Then
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	MAX(GoodsReturn.OperationKind = VALUE(Enum.OperationTypesGoodsReturn.FromCustomer)) AS FromCustomer,
		|	MAX(GoodsReturn.OperationKind = VALUE(Enum.OperationTypesGoodsReturn.ToSupplier)) AS ToSupplier,
		|	GoodsReturn.Date AS Date,
		|	GoodsReturn.Company AS Company
		|INTO Documents
		|FROM
		|	Document.GoodsReturn AS GoodsReturn
		|WHERE
		|	GoodsReturn.Posted
		|	AND GoodsReturn.Date > &Period
		|	AND GoodsReturn.Company = &Company
		|
		|GROUP BY
		|	GoodsReturn.Date,
		|	GoodsReturn.Company
		|
		|UNION ALL
		|
		|SELECT
		|	TRUE,
		|	FALSE,
		|	CreditNote.Date,
		|	CreditNote.Company
		|FROM
		|	Document.CreditNote AS CreditNote
		|WHERE
		|	CreditNote.Posted
		|	AND CreditNote.Date > &Period
		|	AND CreditNote.Company = &Company
		|
		|GROUP BY
		|	CreditNote.Date,
		|	CreditNote.Company
		|
		|UNION ALL
		|
		|SELECT
		|	FALSE,
		|	TRUE,
		|	DebitNote.Date,
		|	DebitNote.Company
		|FROM
		|	Document.DebitNote AS DebitNote
		|WHERE
		|	DebitNote.Posted
		|	AND DebitNote.Date > &Period
		|	AND DebitNote.Company = &Company
		|
		|GROUP BY
		|	DebitNote.Date,
		|	DebitNote.Company
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT TOP 1
		|	Inventory.Period AS Period,
		|	Inventory.Company AS Company
		|INTO SalesDocuments
		|FROM
		|	AccumulationRegister.Inventory AS Inventory
		|WHERE
		|	Inventory.Period >= &Period
		|	AND Inventory.Company = &Company
		|	AND &InventoryValuationMethodWasChanged
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	GoodsReturn.Company AS Company,
		|	MAX(AccountingPolicy.Period) AS Period,
		|	GoodsReturn.Date AS Date,
		|	GoodsReturn.FromCustomer AS FromCustomer,
		|	GoodsReturn.ToSupplier AS ToSupplier
		|INTO MaxPeriod
		|FROM
		|	Documents AS GoodsReturn
		|		LEFT JOIN InformationRegister.AccountingPolicy AS AccountingPolicy
		|		ON GoodsReturn.Company = AccountingPolicy.Company
		|			AND GoodsReturn.Date >= AccountingPolicy.Period
		|
		|GROUP BY
		|	GoodsReturn.Company,
		|	GoodsReturn.Date,
		|	GoodsReturn.FromCustomer,
		|	GoodsReturn.ToSupplier
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	MaxPeriod.Company AS Company,
		|	MaxPeriod.Period AS Period,
		|	MaxPeriod.Date AS Date
		|FROM
		|	MaxPeriod AS MaxPeriod
		|WHERE
		|	MaxPeriod.Period = &Period
		|	AND &UseGoodsReturnFromCustomerWasChanged
		|	AND MaxPeriod.FromCustomer
		|
		|UNION ALL
		|
		|SELECT
		|	MaxPeriod.Company AS Company,
		|	MaxPeriod.Period AS Period,
		|	MaxPeriod.Date AS Date
		|FROM
		|	MaxPeriod AS MaxPeriod
		|WHERE
		|	MaxPeriod.Period = &Period
		|	AND &UseGoodsReturnToSupplierWasChanged
		|	AND MaxPeriod.ToSupplier
		|
		|UNION ALL
		|
		|SELECT
		|	MaxPeriod.Company AS Company,
		|	MaxPeriod.Period AS Period,
		|	MaxPeriod.Date AS Date
		|FROM
		|	MaxPeriod AS MaxPeriod
		|WHERE
		|	MaxPeriod.Period < &Period
		|	AND MaxPeriod.Date > &Period
		|
		|UNION ALL
		|
		|SELECT
		|	Inventory.Company AS Company,
		|	Inventory.Period AS Period,
		|	Inventory.Period AS Date
		|FROM
		|	SalesDocuments AS Inventory
		|";
		
		Query.SetParameter("Company",	CurrentObject.Company);
		Query.SetParameter("Period",	CurrentObject.Period);
		Query.SetParameter("UseGoodsReturnFromCustomerWasChanged",	UseGoodsReturnFromCustomerWasChanged);
		Query.SetParameter("UseGoodsReturnToSupplierWasChanged",	UseGoodsReturnToSupplierWasChanged);
		Query.SetParameter("InventoryValuationMethodWasChanged",	InventoryValuationMethodWasChanged);
		
		QueryResult = Query.Execute();
		If Not QueryResult.IsEmpty() Then
			CommonUseClientServer.MessageToUser(
				NStr("en = 'There are documents which were created with the current accounting policy setting.
					|To apply the new settings, please create a new accounting policy setting.'")
				,,,,
				Cancel);
		EndIf;
	EndIf;
	
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	
	If RegisteredForVAT <> Record.RegisteredForVAT 
		OR PostVATEntriesBySourceDocuments <> Record.PostVATEntriesBySourceDocuments
		OR UseGoodsReturnFromCustomer <> Record.UseGoodsReturnFromCustomer
		OR UseGoodsReturnToSupplier <> Record.UseGoodsReturnToSupplier Then
		
		RefreshInterface();
	EndIf;
	
EndProcedure

&AtClient
Procedure RegisteredForVATOnChange(Item)
	
	Items.GroupVATOptionsRight.Enabled = Record.RegisteredForVAT;
	
	If Not Record.RegisteredForVAT Then
		ChangeRegisteredForVATAtServer();
	EndIf;

EndProcedure

&AtClient
Procedure PostVATEntriesBySourceDocumentsOnChange(Item)
	PostVATEntriesBySourceDocumentsAtServer();
	SetIssueAutomaticallyAgainstSales();
EndProcedure

&AtClient
Procedure PostAdvancePaymentsBySourceDocumentsOnChange(Item)
	PostAdvancePaymentsBySourceDocumentsAtServer();
EndProcedure

#EndRegion

#Region OtherProceduresAndFunctions

&AtServer
Procedure SetIssueAutomaticallyAgainstSales()
	
	Items.IssueAutomaticallyAgainstSales.Enabled = Not PostVATEntriesBySourceDocuments;
	
	If PostVATEntriesBySourceDocuments
		AND AccessRight("Update", Metadata.InformationRegisters.AccountingPolicy) Then
		Record.IssueAutomaticallyAgainstSales = False;
	EndIf;
	
EndProcedure

&AtServer
Procedure ChangeRegisteredForVATAtServer()
	
	Option = New Structure("Name, Synonym",
		"RegisteredForVAT",
		Metadata.InformationRegisters.AccountingPolicy.Resources.RegisteredForVAT.Synonym);
		
	CheckVATRecords(Option);
	
	Items.GroupVATOptionsRight.Enabled = Record.RegisteredForVAT;
	If Not Record.RegisteredForVAT Then
		Record.IssueAutomaticallyAgainstSales = False;
		Record.PostAdvancePaymentsBySourceDocuments = True;
		Record.PostVATEntriesBySourceDocuments = True;
	EndIf;
	
EndProcedure

&AtServer
Procedure PostVATEntriesBySourceDocumentsAtServer()
	
	Record.PostVATEntriesBySourceDocuments = PostVATEntriesBySourceDocuments;
	
	Option = New Structure("Name, Synonym",
		"PostVATEntriesBySourceDocuments",
		Metadata.InformationRegisters.AccountingPolicy.Resources.PostVATEntriesBySourceDocuments.Synonym);
		
	CheckVATRecords(Option);
	
	PostVATEntriesBySourceDocuments = Record.PostVATEntriesBySourceDocuments;
	
EndProcedure

&AtServer
Procedure CheckVATRecords(Option)
	
	Query = New Query(
	"SELECT
	|	&MaxDate AS AfterDate,
	|	&Period AS BeforeDate,
	|	&Company AS Company
	|INTO CurrentPolicy
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	MIN(Policy.Period) AS AfterDate,
	|	&MaxDate AS BeforeDate,
	|	Policy.Company AS Company
	|INTO VATPeriod
	|FROM
	|	InformationRegister.AccountingPolicy AS Policy
	|WHERE
	|	Policy.Period > &Period
	|	AND Policy.Company = &Company
	|	AND TRUE
	|
	|GROUP BY
	|	Policy.Company
	|
	|UNION ALL
	|
	|SELECT
	|	&MinDate,
	|	MAX(Policy.Period),
	|	Policy.Company
	|FROM
	|	InformationRegister.AccountingPolicy AS Policy
	|WHERE
	|	Policy.Period < &Period
	|	AND Policy.Company = &Company
	|	AND TRUE
	|
	|GROUP BY
	|	Policy.Company
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	MIN(ISNULL(Boundary.AfterDate, CurrentPolicy.AfterDate)) AS End,
	|	MAX(ISNULL(Boundary.BeforeDate, CurrentPolicy.BeforeDate)) AS Start,
	|	CurrentPolicy.Company AS Company
	|INTO Boundary
	|FROM
	|	CurrentPolicy AS CurrentPolicy
	|		LEFT JOIN VATPeriod AS Boundary
	|		ON (TRUE)
	|
	|GROUP BY
	|	CurrentPolicy.Company
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT TOP 1
	|	1
	|FROM
	|	AccumulationRegister.VATIncurred AS VATIncurred
	|		INNER JOIN Boundary AS Boundary
	|		ON VATIncurred.Company = Boundary.Company
	|			AND VATIncurred.Period >= Boundary.Start
	|			AND VATIncurred.Period <= Boundary.End
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	1
	|FROM
	|	AccumulationRegister.VATInput AS VATInput
	|		INNER JOIN Boundary AS Boundary
	|		ON VATInput.Company = Boundary.Company
	|			AND VATInput.Period >= Boundary.Start
	|			AND VATInput.Period <= Boundary.End
	|
	|UNION ALL
	|
	|SELECT TOP 1
	|	1
	|FROM
	|	AccumulationRegister.VATOutput AS VATOutput
	|		INNER JOIN Boundary AS Boundary
	|		ON VATOutput.Company = Boundary.Company
	|			AND VATOutput.Period >= Boundary.Start
	|			AND VATOutput.Period <= Boundary.End");
	
	Query.Text = StrReplace(Query.Text, "AND TRUE", "AND Policy." + Option.Name);
	
	Query.SetParameter("MinDate", Date("00010101"));
	Query.SetParameter("MaxDate", Date("39991231"));
	Query.SetParameter("Period", Record.Period);
	Query.SetParameter("Company", Record.Company);
	
	If Not Query.Execute().IsEmpty() Then
		
		TextMessage = StringFunctionsClientServer.SubstituteParametersInString(
			NStr("en = 'You can''t change the option ""%1"" because there are records in VAT registers.'"),
			Option.Synonym);
			
		CommonUseClientServer.MessageToUser(TextMessage);
			
		// Return the previous value
		Record[Option.Name] = Not Record[Option.Name];
	EndIf;

EndProcedure

&AtServer
Procedure PostAdvancePaymentsBySourceDocumentsAtServer()
	
	Record.PostAdvancePaymentsBySourceDocuments = PostAdvancePaymentsBySourceDocuments;
	
	Option = New Structure("Name, Synonym",
		"PostAdvancePaymentsBySourceDocuments",
		Metadata.InformationRegisters.AccountingPolicy.Resources.PostAdvancePaymentsBySourceDocuments.Synonym);
		
	CheckVATRecords(Option);
	
	PostAdvancePaymentsBySourceDocuments = Record.PostAdvancePaymentsBySourceDocuments;
	
EndProcedure

Procedure ChangeEnabled()
	
	UseGoodsReturnFromCustomer		= ?(Record.UseGoodsReturnFromCustomer, Enums.YesNo.Yes, Enums.YesNo.No);
	UseGoodsReturnToSupplier		= ?(Record.UseGoodsReturnToSupplier, Enums.YesNo.Yes, Enums.YesNo.No);
	
EndProcedure

#EndRegion
